<!-- terraform-plan-aws_general-purpose-pr-5 -->
## 📝 Terraform Plan for `aws/general-purpose` (PR #5)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository_policy.main will be destroyed
  # (because aws_ecr_repository_policy.main is not in configuration)
  - resource "aws_ecr_repository_policy" "main" {
      - id          = "ishiori-k8s-private-ecr" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::319844025384:role/ECRFullAccessRole"
                        }
                      - Sid       = "AllowPullFromECRRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region      = "ap-northeast-1" -> null
      - registry_id = "319844025384" -> null
      - repository  = "ishiori-k8s-private-ecr" -> null
    }

  # aws_iam_instance_profile.ecr_instance_profile will be destroyed
  # (because aws_iam_instance_profile.ecr_instance_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ecr_instance_profile" {
      - arn         = "arn:aws:iam::319844025384:instance-profile/ECRInstanceProfile" -> null
      - create_date = "2025-08-15T13:58:58Z" -> null
      - id          = "ECRInstanceProfile" -> null
      - name        = "ECRInstanceProfile" -> null
      - path        = "/" -> null
      - role        = "ECRFullAccessRole" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAUU6BQQQUP23SE7IXV" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.ecr_full_access_policy will be destroyed
  # (because aws_iam_policy.ecr_full_access_policy is not in configuration)
  - resource "aws_iam_policy" "ecr_full_access_policy" {
      - arn              = "arn:aws:iam::319844025384:policy/ECRFullAccessPolicy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy that provides full access to ECR repositories" -> null
      - id               = "arn:aws:iam::319844025384:policy/ECRFullAccessPolicy" -> null
      - name             = "ECRFullAccessPolicy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:*",
                          - "ecr-public:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = [
                          - "sts:GetServiceBearerToken",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "sts:AWSServiceName" = "codeartifact.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUU6BQQQUJ4JTGG3Z5" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.ecr_pull_access_policy will be created
  + resource "aws_iam_policy" "ecr_pull_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy that provides pull access to private ECR repositories"
      + id               = (known after apply)
      + name             = "ECRPullAccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:*:319844025384:repository/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.ecr_full_access_role will be destroyed
  # (because aws_iam_role.ecr_full_access_role is not in configuration)
  - resource "aws_iam_role" "ecr_full_access_role" {
      - arn                   = "arn:aws:iam::319844025384:role/ECRFullAccessRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = [
                              - "ec2.amazonaws.com",
                              - "ecs-tasks.amazonaws.com",
                              - "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-15T13:57:25Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ECRFullAccessRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::319844025384:policy/ECRFullAccessPolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ECRFullAccessRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUU6BQQQUDDOJVRG5F" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.ecr_pull_role will be created
  + resource "aws_iam_role" "ecr_pull_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::319844025384:role/AWSReservedSSO_AdministratorAccess_*"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ECRPullRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr_full_access_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.ecr_full_access_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecr_full_access_attachment" {
      - id         = "ECRFullAccessRole/arn:aws:iam::319844025384:policy/ECRFullAccessPolicy" -> null
      - policy_arn = "arn:aws:iam::319844025384:policy/ECRFullAccessPolicy" -> null
      - role       = "ECRFullAccessRole" -> null
    }

  # aws_iam_role_policy_attachment.ecr_pull_access_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecr_pull_access_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ECRPullRole"
    }

Plan: 3 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ current_aws_caller_identity = {
      ~ arn_without_session = "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-16991417854" -> "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-17008823967"
        # (1 unchanged attribute hidden)
    }
```

</details>

*Workflow run: [`17008823967`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/17008823967)*
